In [8]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [9]:
DataFrame()

Empty DataFrame
Columns: []
Index: []

In [10]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
           'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
           'age': [42,52,36,24,73],
           'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
#df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df = DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [11]:
DataFrame(raw_data, columns = ["age", "city"])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [12]:
DataFrame(raw_data, columns = ["First_name", "last_name", "age", "city", "debt"])

  First_name last_name  age           city debt
0        NaN    Miller   42  San Francisco  NaN
1        NaN  Jacobson   52      Baltimore  NaN
2        NaN       Ali   36          Miami  NaN
3        NaN    Milner   24        Douglas  NaN
4        NaN     Cooze   73         Boston  NaN

In [20]:
df = DataFrame(raw_data, columns = ["first_name", "last_name", "age", "city", "debt"])
df.first_name, df.last_name, df.age, df.city, df.debt

(0    Jason
 1    Molly
 2     Tina
 3     Jake
 4      Amy
 Name: first_name, dtype: object,
 0      Miller
 1    Jacobson
 2         Ali
 3      Milner
 4       Cooze
 Name: last_name, dtype: object,
 0    42
 1    52
 2    36
 3    24
 4    73
 Name: age, dtype: int64,
 0    San Francisco
 1        Baltimore
 2            Miami
 3          Douglas
 4           Boston
 Name: city, dtype: object,
 0    NaN
 1    NaN
 2    NaN
 3    NaN
 4    NaN
 Name: debt, dtype: object)

In [21]:
df["first_name"], df["last_name"], df["age"], df["city"]

(0    Jason
 1    Molly
 2     Tina
 3     Jake
 4      Amy
 Name: first_name, dtype: object,
 0      Miller
 1    Jacobson
 2         Ali
 3      Milner
 4       Cooze
 Name: last_name, dtype: object,
 0    42
 1    52
 2    36
 3    24
 4    73
 Name: age, dtype: int64,
 0    San Francisco
 1        Baltimore
 2            Miami
 3          Douglas
 4           Boston
 Name: city, dtype: object)

In [22]:
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [23]:
df.loc[1] #loc - index location

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [27]:
df["age"].iloc[1:] #iloc - index position

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [28]:
s = pd.Series(np.nan, index=[49,48,47,46,45,1,2,3,4,5])
s.loc[:3] # loc는 index 이름.

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [29]:
s.iloc[:3] # iloc는 index number

49   NaN
48   NaN
47   NaN
dtype: float64

In [32]:
df.debt = df.age > 40 #debt columnt에 새로운 값을 할당.
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [33]:
df.T #transpose

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [34]:
df.values # 값 출력.

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [36]:
df.to_csv() #csv 변환

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Molly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [37]:
del df["debt"] #"debt" column을 삭제.
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [40]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
DataFrame(pop), DataFrame(pop).T

(      Nevada  Ohio
 2001     2.4   1.7
 2002     2.9   3.6
 2000     NaN   1.5,
         2001  2002  2000
 Nevada   2.4   2.9   NaN
 Ohio     1.7   3.6   1.5)